# Smoothness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..Smoothness Property
Material Class See Also
---
The smoothness of the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Smoothness { get; set; }
```

Visual Basic
---
```text
Public Property Smoothness As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Smoothness {
	int get ();
	void set (int value);
}
```

# ### Field Value
The value ranges from 0 to 100.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: values for shininess must be between 0 and 128 |

# See Also
Material Class
Autodesk.Revit.DB Namespace